Ran Plan for 2 projects:

1. project: `cvm` dir: `cvm` workspace: `default`
1. project: `clb` dir: `clb` workspace: `default`
---

### 1. project: `cvm` dir: `cvm` workspace: `default`
<details><summary>Show Output</summary>

```diff
Fetching temporary credentials...
Token=Vrxm1ywTfa4aXAbzMXFccHgH4eevZ1Pad33cbf88d00db7dcf9106a1dab7a61faoJokZlTGrlccNUYPdegra_8qn5SLoZHta5hyJhCv56khoEkCKamyPVLTj7u8-Nc6rHl7rie-EDYw1sPyDCeYyndxq3_TzbMEqVoePWGcvdzvKdoy3XaGzxV5wx3VcWwjUKfkeiIJ3K7y7ue7pPuLEdeNmNbzj0vZ4m9dAtpPtWKks5D35niMFUXMMhuePm1e91cY60KUEhe6FFfBRyqEYBSD9yfwnsKz9iUZon9OFw0FCfJcoMRqV-t3NPOvMPbS-_l_oso-Xt7QSYtQLpOn-khrynw1iGJPNgl-_WeV9scsoz18jv-X_Grv0wPSuIe-NT7Sz86nf5Il6U4ACgFckBHo0xdhzrXLwO8ytPbByY9pCo4-buNoyKUoK1cMbsrQWGnn2SMiBGbMoUp7MGTFA-l60J_1qWbpdVIBf8LOkuc
TmpSecretId=AKIDln4PpOlOWRxRD-iCea38IDtUeG55eC6_8BmSoTLyQvzaaz1tuJNaFY6q2oFCrQEK
TmpSecretKey=btIIPGv1ImGvLmE5yDj+bKnGi2b6Ysvy7GpaI3DhUgk=
Setting environment variables...
TENCENTCLOUD_SECRET_ID=AKIDln4PpOlOWRxRD-iCea38IDtUeG55eC6_8BmSoTLyQvzaaz1tuJNaFY6q2oFCrQEK
TENCENTCLOUD_SECRET_KEY=btIIPGv1ImGvLmE5yDj+bKnGi2b6Ysvy7GpaI3DhUgk=
TENCENTCLOUD_SECURITY_TOKEN=Vrxm1ywTfa4aXAbzMXFccHgH4eevZ1Pad33cbf88d00db7dcf9106a1dab7a61faoJokZlTGrlccNUYPdegra_8qn5SLoZHta5hyJhCv56khoEkCKamyPVLTj7u8-Nc6rHl7rie-EDYw1sPyDCeYyndxq3_TzbMEqVoePWGcvdzvKdoy3XaGzxV5wx3VcWwjUKfkeiIJ3K7y7ue7pPuLEdeNmNbzj0vZ4m9dAtpPtWKks5D35niMFUXMMhuePm1e91cY60KUEhe6FFfBRyqEYBSD9yfwnsKz9iUZon9OFw0FCfJcoMRqV-t3NPOvMPbS-_l_oso-Xt7QSYtQLpOn-khrynw1iGJPNgl-_WeV9scsoz18jv-X_Grv0wPSuIe-NT7Sz86nf5Il6U4ACgFckBHo0xdhzrXLwO8ytPbByY9pCo4-buNoyKUoK1cMbsrQWGnn2SMiBGbMoUp7MGTFA-l60J_1qWbpdVIBf8LOkuc
Initializing the backend...
Initializing provider plugins...
- Finding latest version of tencentcloudstack/tencentcloud...
- Installing tencentcloudstack/tencentcloud v1.81.113...
- Installed tencentcloudstack/tencentcloud v1.81.113 (signed by a HashiCorp partner, key ID 84F69E1C1BECF459)
Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Fetching temporary credentials...
Token=Vrxm1ywTfa4aXAbzMXFccHgH4eevZ1Paa082d236ea3b46cfb73db2210200820foJokZlTGrlccNUYPdegrayVQEbG0eDnqfsam-U5YftfcGz-k6FudZxn8GW4KJViGmj5nWgu4OjrZA6LjN8oDs9ODtXDVXUIoXLZcFH65-KCeIGNffc0PswWdirEsWY3UAOJ_7su-wZk7FpKwJaopOM9MyYJwewufiXO29R1nli55AaNgxlzHZR3FAPnkS6lGhZpn26YYFGplPeGlcoIXTxxc9rBn89x5bI0o8ZKfxlXeoBK3nCjpnfV5dNnd9V5hbc2jvT39DJ7oes-ddvnx_YyKYqliAI8rKDgrsA9qd4K5YpcBgAkUKJu4P8DhFJyG4FBoNejMH-GmDpiNJOyLeA5fICv2xObnt1nvlDDbxr96Z5fyyzMsKyo67120MMLaEJkxc_iSegtd26aorG-Obp6JHmnnnCCmpSwxMF5WnI8
TmpSecretId=AKIDKpYY13YfUwhm4gSJLvxF2rP13-4YtFrl2Tsh-_2LrR89tGI_ZeIHiC7ePUhQd5_E
TmpSecretKey=NXrLir9yh18GMb93QOrmc/1NPoUcwYhZE1/zZkguN7I=
Setting environment variables...
TENCENTCLOUD_SECRET_ID=AKIDKpYY13YfUwhm4gSJLvxF2rP13-4YtFrl2Tsh-_2LrR89tGI_ZeIHiC7ePUhQd5_E
TENCENTCLOUD_SECRET_KEY=NXrLir9yh18GMb93QOrmc/1NPoUcwYhZE1/zZkguN7I=
TENCENTCLOUD_SECURITY_TOKEN=Vrxm1ywTfa4aXAbzMXFccHgH4eevZ1Paa082d236ea3b46cfb73db2210200820foJokZlTGrlccNUYPdegrayVQEbG0eDnqfsam-U5YftfcGz-k6FudZxn8GW4KJViGmj5nWgu4OjrZA6LjN8oDs9ODtXDVXUIoXLZcFH65-KCeIGNffc0PswWdirEsWY3UAOJ_7su-wZk7FpKwJaopOM9MyYJwewufiXO29R1nli55AaNgxlzHZR3FAPnkS6lGhZpn26YYFGplPeGlcoIXTxxc9rBn89x5bI0o8ZKfxlXeoBK3nCjpnfV5dNnd9V5hbc2jvT39DJ7oes-ddvnx_YyKYqliAI8rKDgrsA9qd4K5YpcBgAkUKJu4P8DhFJyG4FBoNejMH-GmDpiNJOyLeA5fICv2xObnt1nvlDDbxr96Z5fyyzMsKyo67120MMLaEJkxc_iSegtd26aorG-Obp6JHmnnnCCmpSwxMF5WnI8

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_instance.cvm_cicd_kk_1 will be created
  + resource "tencentcloud_instance" "cvm_cicd_kk_1" {
      + allocate_public_ip                      = false
      + availability_zone                       = "ap-jakarta-2"
      + cpu                                     = (known after apply)
      + create_time                             = (known after apply)
      + disable_api_termination                 = false
      + disable_monitor_service                 = false
      + disable_security_service                = false
      + expired_time                            = (known after apply)
      + force_delete                            = false
      + hostname                                = "user"
      + id                                      = (known after apply)
      + image_id                                = "img-9qrfy1xt"
      + instance_charge_type                    = "POSTPAID_BY_HOUR"
      + instance_charge_type_prepaid_renew_flag = (known after apply)
      + instance_name                           = "cvm_cicd_kk_1"
      + instance_status                         = (known after apply)
      + instance_type                           = "S5.MEDIUM2"
      + internet_charge_type                    = (known after apply)
      + internet_max_bandwidth_out              = (known after apply)
      + key_ids                                 = (known after apply)
      + key_name                                = (known after apply)
      + memory                                  = (known after apply)
      + orderly_security_groups                 = (known after apply)
      + os_name                                 = (known after apply)
      + private_ip                              = (known after apply)
      + project_id                              = 0
      + public_ip                               = (known after apply)
      + running_flag                            = true
      + security_groups                         = (known after apply)
      + subnet_id                               = (known after apply)
      + system_disk_id                          = (known after apply)
      + system_disk_size                        = 50
      + system_disk_type                        = "CLOUD_PREMIUM"
      + uuid                                    = (known after apply)
      + vpc_id                                  = (known after apply)

      + data_disks {
          + data_disk_id           = (known after apply)
          + data_disk_size         = 50
          + data_disk_type         = "CLOUD_PREMIUM"
          + delete_with_instance   = true
          + encrypt                = false
          + throughput_performance = 0
        }
    }

  # tencentcloud_subnet.cicd_kk will be created
  + resource "tencentcloud_subnet" "cicd_kk" {
      + availability_zone  = "ap-jakarta-2"
      + available_ip_count = (known after apply)
      + cidr_block         = "10.0.1.0/24"
      + create_time        = (known after apply)
      + id                 = (known after apply)
      + is_default         = (known after apply)
      + is_multicast       = false
      + name               = "cicd_kk_subnet"
      + route_table_id     = (known after apply)
      + vpc_id             = (known after apply)
    }

  # tencentcloud_vpc.cicd_kk will be created
  + resource "tencentcloud_vpc" "cicd_kk" {
      + assistant_cidrs        = (known after apply)
      + cidr_block             = "10.0.0.0/16"
      + create_time            = (known after apply)
      + default_route_table_id = (known after apply)
      + dns_servers            = (known after apply)
      + docker_assistant_cidrs = (known after apply)
      + id                     = (known after apply)
      + is_default             = (known after apply)
      + is_multicast           = false
      + name                   = "cicd_kk_vpc"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + instance_id = (known after apply)
  + public_ip   = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p cvm
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://43.133.145.82:4141/events/lock?id=yakir-Yang%252Fterraform-demo-with-cam-sts%252Fcvm%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p cvm
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 2. project: `clb` dir: `clb` workspace: `default`
<details><summary>Show Output</summary>

```diff
Fetching temporary credentials...
Token=Vrxm1ywTfa4aXAbzMXFccHgH4eevZ1Pa0168b16668417f8ccaad8801f923afdcoJokZlTGrlccNUYPdegra3_FR0gh-l5brIBBdqQ07VTCAOUF0Wh4BtPDPOmKCuenGc29pVaYIkDpRUMfK8G-s9YIqiBlCCG80QD10T1x0IRKvva2gJoiacIm0ZT-QG0I7DHS0lYAxwcSShCbJp2UfNVH4XRcJ7LRPlkmencdy7rZpUAmjbMnM9sy28oqjqBqR6sa3NRdl13_AHt-ardlcoOO7idh1wyoJBn8vtoC4erJNePkAsQa_UNI7htJ5rj3mfQ10yjFSMLXLKhH3EEio11lrKEDtV1kqSL55-X3P-EII8_AYNyxS5JZQ_z-s6v2YPR-pdF1mws1_EE3brCroXEVKOecyznVbuPTnDikajpHuT8qhOxHfZoOh9-c4nUJ3k0aRsu_6J-OePipXF5wrxTBKjF6k_ve3UcyuJ64VbE
TmpSecretId=AKID878i4dL6eUS7BoqpzInGeUY6CdM6YZ6ZJNn4R1y_3s998QkBw_UVSTr27ArMZ40P
TmpSecretKey=PLh9ugVxEGho3yYWxWmDyl8xSbIeSucazdoGY+hQ3lQ=
Setting environment variables...
TENCENTCLOUD_SECRET_ID=AKID878i4dL6eUS7BoqpzInGeUY6CdM6YZ6ZJNn4R1y_3s998QkBw_UVSTr27ArMZ40P
TENCENTCLOUD_SECRET_KEY=PLh9ugVxEGho3yYWxWmDyl8xSbIeSucazdoGY+hQ3lQ=
TENCENTCLOUD_SECURITY_TOKEN=Vrxm1ywTfa4aXAbzMXFccHgH4eevZ1Pa0168b16668417f8ccaad8801f923afdcoJokZlTGrlccNUYPdegra3_FR0gh-l5brIBBdqQ07VTCAOUF0Wh4BtPDPOmKCuenGc29pVaYIkDpRUMfK8G-s9YIqiBlCCG80QD10T1x0IRKvva2gJoiacIm0ZT-QG0I7DHS0lYAxwcSShCbJp2UfNVH4XRcJ7LRPlkmencdy7rZpUAmjbMnM9sy28oqjqBqR6sa3NRdl13_AHt-ardlcoOO7idh1wyoJBn8vtoC4erJNePkAsQa_UNI7htJ5rj3mfQ10yjFSMLXLKhH3EEio11lrKEDtV1kqSL55-X3P-EII8_AYNyxS5JZQ_z-s6v2YPR-pdF1mws1_EE3brCroXEVKOecyznVbuPTnDikajpHuT8qhOxHfZoOh9-c4nUJ3k0aRsu_6J-OePipXF5wrxTBKjF6k_ve3UcyuJ64VbE
Initializing the backend...
Initializing provider plugins...
- Finding latest version of tencentcloudstack/tencentcloud...
- Installing tencentcloudstack/tencentcloud v1.81.113...
- Installed tencentcloudstack/tencentcloud v1.81.113 (signed by a HashiCorp partner, key ID 84F69E1C1BECF459)
Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Fetching temporary credentials...
Token=Vrxm1ywTfa4aXAbzMXFccHgH4eevZ1Pa268eff850646bfe983c23e870a076c98oJokZlTGrlccNUYPdegra_j3oMGPyheo_uai3icGnHy1RL1aFm_s__g-SHNhrUhFTuGAQCD_fuPda73j4M6AcmgcP99PNVYNOMeH4qZI_FkZcBvsTcHT2T3b7ZoZnS2_MIGL9K9V9_Q6YoMiZeggbyyvjD6G5Ue1Ze8ONeOqQz95bCJHStyIBVAZFJkHRBuxuobZ-KEhaiZKoAxGWufbNCxrj1MB0gcCqSPqoX3d_rs0UDdJZnFXpStRXpzLyIp1O_8MWgh-hEm7pZIOqp_rySLvnUtqnRckAg9TpBpthXDtFmV-QY81gpdS7yZNDPRjAuDieVbGmJLKNy6B3XkLclSTnlHcB2xjRlE9YdMdjEWw0AL6ZXXnrGAZ3qXDyN9ye64cgcZlcgS74pMmaSLR_cV_elhhgbb4SfTI7laqK70
TmpSecretId=AKIDodcYrp3OgTDQgb7xW9H6No7V52C47JXLmW9C4doNPdO5rFWDWokoQGNEFxpdChF5
TmpSecretKey=xQVuBzbSsU3T3+is4vNF3KiB2xRXv+FSQ3Hi2lx15B0=
Setting environment variables...
TENCENTCLOUD_SECRET_ID=AKIDodcYrp3OgTDQgb7xW9H6No7V52C47JXLmW9C4doNPdO5rFWDWokoQGNEFxpdChF5
TENCENTCLOUD_SECRET_KEY=xQVuBzbSsU3T3+is4vNF3KiB2xRXv+FSQ3Hi2lx15B0=
TENCENTCLOUD_SECURITY_TOKEN=Vrxm1ywTfa4aXAbzMXFccHgH4eevZ1Pa268eff850646bfe983c23e870a076c98oJokZlTGrlccNUYPdegra_j3oMGPyheo_uai3icGnHy1RL1aFm_s__g-SHNhrUhFTuGAQCD_fuPda73j4M6AcmgcP99PNVYNOMeH4qZI_FkZcBvsTcHT2T3b7ZoZnS2_MIGL9K9V9_Q6YoMiZeggbyyvjD6G5Ue1Ze8ONeOqQz95bCJHStyIBVAZFJkHRBuxuobZ-KEhaiZKoAxGWufbNCxrj1MB0gcCqSPqoX3d_rs0UDdJZnFXpStRXpzLyIp1O_8MWgh-hEm7pZIOqp_rySLvnUtqnRckAg9TpBpthXDtFmV-QY81gpdS7yZNDPRjAuDieVbGmJLKNy6B3XkLclSTnlHcB2xjRlE9YdMdjEWw0AL6ZXXnrGAZ3qXDyN9ye64cgcZlcgS74pMmaSLR_cV_elhhgbb4SfTI7laqK70

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_clb_attachment.attachment_tcp will be created
  + resource "tencentcloud_clb_attachment" "attachment_tcp" {
      + clb_id        = (known after apply)
      + id            = (known after apply)
      + listener_id   = (known after apply)
      + protocol_type = (known after apply)

      + targets {
          + instance_id = (known after apply)
          + port        = 8080
          + weight      = 10
            # (1 unchanged attribute hidden)
        }
      + targets {
          + instance_id = (known after apply)
          + port        = 8080
          + weight      = 10
            # (1 unchanged attribute hidden)
        }
    }

  # tencentcloud_clb_instance.cicd_foo will be created
  + resource "tencentcloud_clb_instance" "cicd_foo" {
      + address_ip_version           = (known after apply)
      + address_ipv6                 = (known after apply)
      + clb_name                     = "cicd_foo_clb"
      + clb_vips                     = (known after apply)
      + domain                       = (known after apply)
      + id                           = (known after apply)
      + internet_bandwidth_max_out   = (known after apply)
      + internet_charge_type         = (known after apply)
      + ipv6_mode                    = (known after apply)
      + load_balancer_pass_to_target = false
      + master_zone_id               = (known after apply)
      + network_type                 = "OPEN"
      + project_id                   = 0
      + security_groups              = (known after apply)
      + sla_type                     = (known after apply)
      + slave_zone_id                = (known after apply)
      + target_region_info_region    = (known after apply)
      + target_region_info_vpc_id    = (known after apply)
      + vip                          = (known after apply)
      + vip_isp                      = (known after apply)
      + vpc_id                       = (known after apply)
      + zone_id                      = (known after apply)
    }

  # tencentcloud_clb_listener.listener_http_dst will be created
  + resource "tencentcloud_clb_listener" "listener_http_dst" {
      + clb_id                     = (known after apply)
      + end_port                   = (known after apply)
      + health_check_context_type  = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + health_source_ip_type      = (known after apply)
      + id                         = (known after apply)
      + keepalive_enable           = (known after apply)
      + listener_id                = (known after apply)
      + listener_name              = "listener_http_dst"
      + port                       = 81
      + protocol                   = "HTTP"
      + scheduler                  = "WRR"
      + session_type               = (known after apply)
      + target_type                = (known after apply)
    }

  # tencentcloud_clb_listener.listener_http_src will be created
  + resource "tencentcloud_clb_listener" "listener_http_src" {
      + clb_id                     = (known after apply)
      + end_port                   = (known after apply)
      + health_check_context_type  = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + health_source_ip_type      = (known after apply)
      + id                         = (known after apply)
      + keepalive_enable           = (known after apply)
      + listener_id                = (known after apply)
      + listener_name              = "listener_http_src"
      + port                       = 80
      + protocol                   = "HTTP"
      + scheduler                  = "WRR"
      + session_type               = (known after apply)
      + target_type                = (known after apply)
    }

  # tencentcloud_clb_listener.listener_tcp will be created
  + resource "tencentcloud_clb_listener" "listener_tcp" {
      + clb_id                     = (known after apply)
      + end_port                   = (known after apply)
      + health_check_context_type  = (known after apply)
      + health_check_health_num    = 2
      + health_check_http_code     = 2
      + health_check_http_method   = "GET"
      + health_check_http_version  = "HTTP/1.0"
      + health_check_interval_time = 100
      + health_check_port          = 200
      + health_check_switch        = true
      + health_check_time_out      = 30
      + health_check_type          = "HTTP"
      + health_check_unhealth_num  = 2
      + health_source_ip_type      = (known after apply)
      + id                         = (known after apply)
      + keepalive_enable           = (known after apply)
      + listener_id                = (known after apply)
      + listener_name              = "listener_tcp"
      + port                       = 8080
      + protocol                   = "TCP"
      + scheduler                  = "WRR"
      + session_expire_time        = 30
      + session_type               = (known after apply)
      + target_type                = (known after apply)
    }

  # tencentcloud_clb_listener_rule.rule_http_dst will be created
  + resource "tencentcloud_clb_listener_rule" "rule_http_dst" {
      + clb_id                     = (known after apply)
      + domain                     = "abcd.com"
      + forward_type               = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_code     = (known after apply)
      + health_check_http_domain   = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_http_path     = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + http2_switch               = (known after apply)
      + id                         = (known after apply)
      + listener_id                = (known after apply)
      + quic                       = (known after apply)
      + rule_id                    = (known after apply)
      + scheduler                  = "WRR"
      + session_expire_time        = 30
      + target_type                = "NODE"
      + url                        = "/"
    }

  # tencentcloud_clb_listener_rule.rule_http_src will be created
  + resource "tencentcloud_clb_listener_rule" "rule_http_src" {
      + clb_id                     = (known after apply)
      + domain                     = "abc.com"
      + forward_type               = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_code     = (known after apply)
      + health_check_http_domain   = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_http_path     = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + http2_switch               = (known after apply)
      + id                         = (known after apply)
      + listener_id                = (known after apply)
      + quic                       = (known after apply)
      + rule_id                    = (known after apply)
      + scheduler                  = "WRR"
      + session_expire_time        = 30
      + target_type                = "NODE"
      + url                        = "/"
    }

  # tencentcloud_clb_redirection.redirection_http will be created
  + resource "tencentcloud_clb_redirection" "redirection_http" {
      + clb_id                  = (known after apply)
      + delete_all_auto_rewrite = false
      + id                      = (known after apply)
      + source_listener_id      = (known after apply)
      + source_rule_id          = (known after apply)
      + target_listener_id      = (known after apply)
      + target_rule_id          = (known after apply)
    }

  # tencentcloud_instance.cicd_foo_1 will be created
  + resource "tencentcloud_instance" "cicd_foo_1" {
      + allocate_public_ip                      = false
      + availability_zone                       = "ap-jakarta-2"
      + cpu                                     = (known after apply)
      + create_time                             = (known after apply)
      + disable_api_termination                 = false
      + disable_monitor_service                 = false
      + disable_security_service                = false
      + expired_time                            = (known after apply)
      + force_delete                            = false
      + id                                      = (known after apply)
      + image_id                                = "img-9qrfy1xt"
      + instance_charge_type                    = "POSTPAID_BY_HOUR"
      + instance_charge_type_prepaid_renew_flag = (known after apply)
      + instance_name                           = "cicd_foo_cvm1"
      + instance_status                         = (known after apply)
      + instance_type                           = "S5.MEDIUM2"
      + internet_charge_type                    = (known after apply)
      + internet_max_bandwidth_out              = 0
      + key_ids                                 = (known after apply)
      + key_name                                = (known after apply)
      + memory                                  = (known after apply)
      + orderly_security_groups                 = (known after apply)
      + os_name                                 = (known after apply)
      + private_ip                              = (known after apply)
      + project_id                              = 0
      + public_ip                               = (known after apply)
      + running_flag                            = true
      + security_groups                         = (known after apply)
      + subnet_id                               = (known after apply)
      + system_disk_id                          = (known after apply)
      + system_disk_size                        = 50
      + system_disk_type                        = "CLOUD_PREMIUM"
      + uuid                                    = (known after apply)
      + vpc_id                                  = (known after apply)

      + data_disks (known after apply)
    }

  # tencentcloud_instance.cicd_foo_2 will be created
  + resource "tencentcloud_instance" "cicd_foo_2" {
      + allocate_public_ip                      = false
      + availability_zone                       = "ap-jakarta-2"
      + cpu                                     = (known after apply)
      + create_time                             = (known after apply)
      + disable_api_termination                 = false
      + disable_monitor_service                 = false
      + disable_security_service                = false
      + expired_time                            = (known after apply)
      + force_delete                            = false
      + id                                      = (known after apply)
      + image_id                                = "img-9qrfy1xt"
      + instance_charge_type                    = "POSTPAID_BY_HOUR"
      + instance_charge_type_prepaid_renew_flag = (known after apply)
      + instance_name                           = "cicd_foo_cvm2"
      + instance_status                         = (known after apply)
      + instance_type                           = "S5.MEDIUM2"
      + internet_charge_type                    = (known after apply)
      + internet_max_bandwidth_out              = 0
      + key_ids                                 = (known after apply)
      + key_name                                = (known after apply)
      + memory                                  = (known after apply)
      + orderly_security_groups                 = (known after apply)
      + os_name                                 = (known after apply)
      + private_ip                              = (known after apply)
      + project_id                              = 0
      + public_ip                               = (known after apply)
      + running_flag                            = true
      + security_groups                         = (known after apply)
      + subnet_id                               = (known after apply)
      + system_disk_id                          = (known after apply)
      + system_disk_size                        = 50
      + system_disk_type                        = "CLOUD_PREMIUM"
      + uuid                                    = (known after apply)
      + vpc_id                                  = (known after apply)

      + data_disks (known after apply)
    }

  # tencentcloud_security_group.cicd_foo will be created
  + resource "tencentcloud_security_group" "cicd_foo" {
      + id         = (known after apply)
      + name       = "cicd-foo-sg"
      + project_id = (known after apply)
    }

  # tencentcloud_subnet.cicd_foo will be created
  + resource "tencentcloud_subnet" "cicd_foo" {
      + availability_zone  = "ap-jakarta-2"
      + available_ip_count = (known after apply)
      + cidr_block         = "10.0.0.0/16"
      + create_time        = (known after apply)
      + id                 = (known after apply)
      + is_default         = (known after apply)
      + is_multicast       = false
      + name               = "cicd-foo-subnet"
      + route_table_id     = (known after apply)
      + vpc_id             = (known after apply)
    }

  # tencentcloud_vpc.cicd_foo will be created
  + resource "tencentcloud_vpc" "cicd_foo" {
      + assistant_cidrs        = (known after apply)
      + cidr_block             = "10.0.0.0/16"
      + create_time            = (known after apply)
      + default_route_table_id = (known after apply)
      + dns_servers            = (known after apply)
      + docker_assistant_cidrs = (known after apply)
      + id                     = (known after apply)
      + is_default             = (known after apply)
      + is_multicast           = false
      + name                   = "cicd-foo-vpc"
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + clb_instance_id  = (known after apply)
  + cvm1_instance_id = (known after apply)
  + cvm2_instance_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p clb
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://43.133.145.82:4141/events/lock?id=yakir-Yang%252Fterraform-demo-with-cam-sts%252Fclb%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p clb
  ```
Plan: 13 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 2 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```